In [3]:
import pandas as pd

In [7]:
df_employes=pd.read_csv('employes.csv',header=0,index_col=0)

In [8]:
df_employes.head(3)

        salaire    prime   etat civil date recrutement
nom
Ali    1200.675  100.560  celibataire       20/10/2018
Sonia  2800.786  400.876        marie       30/11/2005
Rahma       NaN  130.987  celibataire       04/02/2017

In [9]:
df_employes

          salaire    prime   etat civil date recrutement
nom
Ali      1200.675  100.560  celibataire       20/10/2018
Sonia    2800.786  400.876        marie       30/11/2005
Rahma         NaN  130.987  celibataire       04/02/2017
Salma    2500.876  340.600        marie       03/02/2010
Ahmed    3100.760      NaN        marie       09/09/2004
Saleh    1300.876  150.900  celibataire       01/01/2017
Ameni    1100.660  130.870  celibataire       11/05/2019
Mehdi    3000.760      NaN        marie       07/07/2000
Salem    1505.760  159.700  celibataire       21/11/2017
Sameh    2700.330  400.000        marie       19/02/1999
Wajdi    1200.980      NaN  celibataire       27/11/2015
Moufida  3700.440  500.000        marie       09/12/1991

In [10]:
df_employes.index

Index(['Ali', 'Sonia', 'Rahma', 'Salma', 'Ahmed', 'Saleh', 'Ameni', 'Mehdi',
       'Salem', 'Sameh', 'Wajdi', 'Moufida'],
      dtype='object', name='nom')

In [11]:
df_employes.columns

Index(['salaire', 'prime', 'etat civil', 'date recrutement'], dtype='object')

In [12]:
df_employes.values

array([[1200.675, 100.56, 'celibataire', '20/10/2018'],
       [2800.786, 400.876, 'marie', '30/11/2005'],
       [nan, 130.987, 'celibataire', '04/02/2017'],
       [2500.876, 340.6, 'marie', '03/02/2010'],
       [3100.76, nan, 'marie', '09/09/2004'],
       [1300.876, 150.9, 'celibataire', '01/01/2017'],
       [1100.66, 130.87, 'celibataire', '11/05/2019'],
       [3000.76, nan, 'marie', '07/07/2000'],
       [1505.76, 159.7, 'celibataire', '21/11/2017'],
       [2700.33, 400.0, 'marie', '19/02/1999'],
       [1200.98, nan, 'celibataire', '27/11/2015'],
       [3700.44, 500.0, 'marie', '09/12/1991']], dtype=object)

In [14]:
df_employes.iloc[:,0]

nom
Ali        1200.675
Sonia      2800.786
Rahma           NaN
Salma      2500.876
Ahmed      3100.760
Saleh      1300.876
Ameni      1100.660
Mehdi      3000.760
Salem      1505.760
Sameh      2700.330
Wajdi      1200.980
Moufida    3700.440
Name: salaire, dtype: float64

In [16]:
df_employes.loc[:,'etat civil']

nom
Ali        celibataire
Sonia            marie
Rahma      celibataire
Salma            marie
Ahmed            marie
Saleh      celibataire
Ameni      celibataire
Mehdi            marie
Salem      celibataire
Sameh            marie
Wajdi      celibataire
Moufida          marie
Name: etat civil, dtype: object